In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder , MinMaxScaler, StandardScaler

In [2]:
data = pd.read_csv('student_assignment.csv')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104 entries, 0 to 103
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Age           103 non-null    float64
 1   Income        104 non-null    float64
 2   Is Student    104 non-null    object
 3   Num Children  101 non-null    float64
 4   Temperature   104 non-null    float64
 5   Rating        104 non-null    float64
dtypes: float64(5), object(1)
memory usage: 5.0+ KB

In [4]:
data

      Age    Income Is Student  Num Children  Temperature  Rating
0    43.0  45893.41       True           0.0         38.2     2.6
1    56.0  69663.07       True           1.0         38.7     3.2
2     NaN  45124.06      False           5.0         36.9     3.9
3    37.0  76724.60      False           2.0         41.6     2.5
4    53.0  58343.03      False           1.0         36.5     3.3
..    ...       ...        ...           ...          ...     ...
99   42.0  46673.04      False           5.0         38.8    10.9
100  35.0  27089.59       True           5.0         35.3     1.6
101  61.0  83082.63       True           4.0         35.6     3.7
102  39.0  61868.49       True           5.0         37.1     3.8
103  47.0  59526.59      False           3.0         36.7     3.2

[104 rows x 6 columns]

In [5]:
data.duplicated().sum()

3

In [7]:
data.drop_duplicates(inplace = True)

In [8]:
data.duplicated().sum()

0

In [9]:
data['Is Student'].replace({'TRUE':1,'Yes':1,'FALSE':0,'NO':0,'True':1,'False':0,'false':0,'true':1,'YES':1},inplace = True)

In [10]:
data['Age'].fillna(data['Age'].median(),inplace = True)

In [11]:
data['Num Children'].isna().sum()

3

In [12]:
data['Num Children'].fillna(data['Num Children'].median(),inplace = True)

In [13]:
for i in data.select_dtypes(include = np.number).columns[:-1]:
    print(i)
    q1 = data[i].quantile(0.25)
    q3 = data[i].quantile(0.75)
    iqr = q3 - q1
    
    low = q1- 1.5*iqr
    hi = q3+ 1.5*iqr
    print("outlier =",data.loc[(data[i]<low) | (data[i]>hi),i])

Age
outlier = 7     511.0
19    301.0
47    438.0
Name: Age, dtype: float64
Income
outlier = Series([], Name: Income, dtype: float64)
Is Student
outlier = Series([], Name: Is Student, dtype: int64)
Num Children
outlier = 82    40.0
Name: Num Children, dtype: float64
Temperature
outlier = Series([], Name: Temperature, dtype: float64)

In [14]:
data =data[data['Age']<100]

In [15]:
data = data[data['Num Children']<10.0]

In [16]:
data

      Age    Income  Is Student  Num Children  Temperature  Rating
0    43.0  45893.41           1           0.0         38.2     2.6
1    56.0  69663.07           1           1.0         38.7     3.2
2    42.0  45124.06           0           5.0         36.9     3.9
3    37.0  76724.60           0           2.0         41.6     2.5
4    53.0  58343.03           0           1.0         36.5     3.3
..    ...       ...         ...           ...          ...     ...
96   48.0  90964.58           0           2.0         38.9     3.9
97   58.0  70679.33           1           4.0         41.3     4.8
98   50.0  97052.37           1           2.0         37.1     4.6
99   42.0  46673.04           0           5.0         38.8    10.9
101  61.0  83082.63           1           4.0         35.6     3.7

[97 rows x 6 columns]

In [20]:
data['Rating'].abs()

0       2.6
1       3.2
2       3.9
3       2.5
4       3.3
       ...
96      3.9
97      4.8
98      4.6
99     10.9
101     3.7
Name: Rating, Length: 97, dtype: float64

In [23]:
scaling = StandardScaler()
data = pd.DataFrame(scaling.fit_transform(data),columns = data.columns)

In [24]:
data

         Age    Income  Is Student  Num Children  Temperature    Rating
0   0.078707 -0.584479    0.911147     -1.692413    -0.103024 -0.503339
1   1.091452  0.486468    0.911147     -1.058575     0.138360 -0.093628
2   0.000803 -0.619143   -1.097518      1.476777    -0.730622  0.384368
3  -0.388714  0.804627   -1.097518     -0.424737     1.538388 -0.571625
4   0.857741 -0.023559   -1.097518     -1.058575    -0.923730 -0.025343
..       ...       ...         ...           ...          ...       ...
92  0.468224  1.446212   -1.097518     -0.424737     0.234914  0.384368
93  1.247259  0.532256    0.911147      0.842939     1.393558  0.998935
94  0.624031  1.720499    0.911147     -0.424737    -0.634069  0.862365
95  0.000803 -0.549353   -1.097518      1.476777     0.186637  5.164333
96  1.480969  1.091089    0.911147      0.842939    -1.358221  0.247798

[97 rows x 6 columns]